package com.ohgiraffers.section05.logical;

public class Application1 {
    public static void main(String[] args) {

        /*
        * 논리 연산자
        * 논리값 (true or false)를 취급하는 연산자이다.
        *
        * 논리 연산자의 종류
        * 1. 논리 연결 연산자
        *   두 개의 피연산자를 가지는 이항 연산자이며, 연산자의 결합 방향은 왼쪽에서 오른쪽이다.
        *   두 개의 논리 식을 판단하여 참과 거짓을 판단한다.
        *   1-1 &&(논리 AND) 연산자 :
        *       -두 개의 논리식 모두 참일 경우 True 반환
        *       -둘 중 한개라도 거짓을 경우 False을 반환하는 연산
        *   1-2 ||(논리 or) 연산자 :
        *       -두 개의 논리식 중 하나가 참일 경우 True 반환
        *       -둘 다 모두 거짓을 경우 False를 반환하는 연산
        * 2. 논리 부정 연산자
        *   피연산자가 하나인 단항연산자로, 피연산자의 결합 방향은 왼쪽에서 오른쪽이다.
        *   2-1 !(논리 NOT) 연산자 : 논리식의 결과가 참이면 거짓을, 거짓이면 참을 반환한다.
        *
        * */

    }
}
